# Data Gathering

## Working with CSV File

### 1. Importing pandas

In [1]:
import pandas as pd

### 2. Opening a local csv file

In [2]:
df=pd.read_csv("test.csv")
df

,Unnamed: 0,Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5,Unnamed: 6,Unnamed: 7,Unnamed: 8,Unnamed: 9,Unnamed: 10,Unnamed: 11,Unnamed: 12,Unnamed: 13,Unnamed: 14
0,0,enrollee_id,city,city_development_index,gender,relevent_experience,enrolled_university,education_level,major_discipline,experience,company_size,company_type,last_new_job,training_hours,target
1,1,29725,city_40,0.776,Male,No relevent experience,no_enrollment,Graduate,STEM,15,50-99,Pvt Ltd,>4,47,0
2,2,11561,city_21,0.624,NaN,No relevent experience,Full time course,Graduate,STEM,5,NaN,NaN,never,83,0
3,3,33241,city_115,0.789,NaN,No relevent experience,NaN,Graduate,Business Degree,<1,NaN,Pvt Ltd,never,52,1
4,4,666,city_162,0.767,Male,Has relevent experience,no_enrollment,Masters,STEM,>20,50-99,Funded Startup,4,8,0

### 3. header parameter

In [8]:
df=pd.read_csv("test.csv",header=1)
df

,0,enrollee_id,city,city_development_index,gender,relevent_experience,enrolled_university,education_level,major_discipline,experience,company_size,company_type,last_new_job,training_hours,target
0,1,29725,city_40,0.776,Male,No relevent experience,no_enrollment,Graduate,STEM,15,50-99,Pvt Ltd,>4,47,0
1,2,11561,city_21,0.624,NaN,No relevent experience,Full time course,Graduate,STEM,5,NaN,NaN,never,83,0
2,3,33241,city_115,0.789,NaN,No relevent experience,NaN,Graduate,Business Degree,<1,NaN,Pvt Ltd,never,52,1
3,4,666,city_162,0.767,Male,Has relevent experience,no_enrollment,Masters,STEM,>20,50-99,Funded Startup,4,8,0

### 4. usecols parameter

In [19]:
df=pd.read_csv("test.csv",header=1,usecols=['gender','city'])
df

       city gender
0   city_40   Male
1   city_21    NaN
2  city_115    NaN
3  city_162   Male

### 5. skiprows parameter

In [28]:
df=pd.read_csv("test.csv",skiprows=[0,2])
df

,0,enrollee_id,city,city_development_index,gender,relevent_experience,enrolled_university,education_level,major_discipline,experience,company_size,company_type,last_new_job,training_hours,target
0,2,11561,city_21,0.624,NaN,No relevent experience,Full time course,Graduate,STEM,5,NaN,NaN,never,83,0
1,3,33241,city_115,0.789,NaN,No relevent experience,NaN,Graduate,Business Degree,<1,NaN,Pvt Ltd,never,52,1
2,4,666,city_162,0.767,Male,Has relevent experience,no_enrollment,Masters,STEM,>20,50-99,Funded Startup,4,8,0

### 6. encoding parameter

In [29]:
pd.read_csv("test.csv",encoding='latin-1')

,Unnamed: 0,Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5,Unnamed: 6,Unnamed: 7,Unnamed: 8,Unnamed: 9,Unnamed: 10,Unnamed: 11,Unnamed: 12,Unnamed: 13,Unnamed: 14
0,0,enrollee_id,city,city_development_index,gender,relevent_experience,enrolled_university,education_level,major_discipline,experience,company_size,company_type,last_new_job,training_hours,target
1,1,29725,city_40,0.776,Male,No relevent experience,no_enrollment,Graduate,STEM,15,50-99,Pvt Ltd,>4,47,0
2,2,11561,city_21,0.624,NaN,No relevent experience,Full time course,Graduate,STEM,5,NaN,NaN,never,83,0
3,3,33241,city_115,0.789,NaN,No relevent experience,NaN,Graduate,Business Degree,<1,NaN,Pvt Ltd,never,52,1
4,4,666,city_162,0.767,Male,Has relevent experience,no_enrollment,Masters,STEM,>20,50-99,Funded Startup,4,8,0

### 6. dtype parameter

In [31]:
pd.read_csv("test.csv" ,header=1).info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 15 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   0                       4 non-null      int64
 1   enrollee_id             4 non-null      int64
 2   city                    4 non-null      object
 3   city_development_index  4 non-null      float64
 4   gender                  2 non-null      object
 5   relevent_experience     4 non-null      object
 6   enrolled_university     3 non-null      object
 7   education_level         4 non-null      object
 8   major_discipline        4 non-null      object
 9   experience              4 non-null      object
 10  company_size            2 non-null      object
 11  company_type            3 non-null      object
 12  last_new_job            4 non-null      object
 13  training_hours          4 non-null      int64
 14  target                  4 non-null      int64
dtypes: float64(1), int64(4), object(10)
memory usage: 612.0+ bytes

In [33]:
pd.read_csv("test.csv" ,header=1,dtype={'target':float}).info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 15 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   0                       4 non-null      int64
 1   enrollee_id             4 non-null      int64
 2   city                    4 non-null      object
 3   city_development_index  4 non-null      float64
 4   gender                  2 non-null      object
 5   relevent_experience     4 non-null      object
 6   enrolled_university     3 non-null      object
 7   education_level         4 non-null      object
 8   major_discipline        4 non-null      object
 9   experience              4 non-null      object
 10  company_size            2 non-null      object
 11  company_type            3 non-null      object
 12  last_new_job            4 non-null      object
 13  training_hours          4 non-null      int64
 14  target                  4 non-null      float64
dtypes: float64(2), int64(3), object(10)
memory usage: 612.0+ bytes

## Working with SQL

### import library

In [1]:
import pandas as pd
from sqlalchemy import create_engine

### create engine

In [2]:
engine=create_engine("mysql+mysqlconnector://root:anjali27@localhost/world")

### Test the connection

In [3]:
with engine.connect() as connection:
    print("connection successful")

connection successful

### Run SQL Queries(Python stye)

#### 1.show tables

In [15]:
query="show tables"
df=pd.read_sql(query,engine)
df

   Tables_in_world
0             city
1          country
2  countrylanguage

#### 2.Show all records from city table

In [16]:
query="select * from city"
df=pd.read_sql(query,engine)
df

        ID            Name CountryCode       District  Population
0        1           Kabul         AFG          Kabol     1780000
1        2        Qandahar         AFG       Qandahar      237500
2        3           Herat         AFG          Herat      186800
3        4  Mazar-e-Sharif         AFG          Balkh      127800
4        5       Amsterdam         NLD  Noord-Holland      731200
...    ...             ...         ...            ...         ...
4074  4075      Khan Yunis         PSE     Khan Yunis      123175
4075  4076          Hebron         PSE         Hebron      119401
4076  4077        Jabaliya         PSE     North Gaza      113901
4077  4078          Nablus         PSE         Nablus      100231
4078  4079           Rafah         PSE          Rafah       92020

[4079 rows x 5 columns]

#### 3. show all records from country table

In [6]:
query="select * from country"
df=pd.read_sql(query,engine)
df

,Code,Name,Continent,Region,SurfaceArea,IndepYear,Population,LifeExpectancy,GNP,GNPOld,LocalName,GovernmentForm,HeadOfState,Capital,Code2
0,ABW,Aruba,North America,Caribbean,193.0,NaN,103000,78.4,828.0,793.0,Aruba,Nonmetropolitan Territory of The Netherlands,Beatrix,129.0,AW
1,AFG,Afghanistan,Asia,Southern and Central Asia,652090.0,1919.0,22720000,45.9,5976.0,NaN,Afganistan/Afqanestan,Islamic Emirate,Mohammad Omar,1.0,AF
2,AGO,Angola,Africa,Central Africa,1246700.0,1975.0,12878000,38.3,6648.0,7984.0,Angola,Republic,JosÃ© Eduardo dos Santos,56.0,AO
3,AIA,Anguilla,North America,Caribbean,96.0,NaN,8000,76.1,63.2,NaN,Anguilla,Dependent Territory of the UK,Elisabeth II,62.0,AI
4,ALB,Albania,Europe,Southern Europe,28748.0,1912.0,3401200,71.6,3205.0,2500.0,ShqipÃ«ria,Republic,Rexhep Mejdani,34.0,AL
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
234,YEM,Yemen,Asia,Middle East,527968.0,1918.0,18112000,59.8,6041.0,5729.0,Al-Yaman,Republic,Ali Abdallah Salih,1780.0,YE
235,YUG,Yugoslavia,Europe,Southern Europe,102173.0,1918.0,10640000,72.4,17000.0,NaN,Jugoslavija,Federal Republic,Vojislav KoÂštunica,1792.0,YU
236,ZAF,South Africa,Africa,Southern Africa,1221037.0,1910.0,40377000,51.1,116729.0,129092.0,South Africa,Republic,Thabo Mbeki,716.0,ZA
237,ZMB,Zambia,Africa,Eastern Africa,752618.0,1964.0,9169000,37.2,3377.0,3922.0,Zambia,Republic,Frederick Chiluba,3162.0,ZM
238,ZWE,Zimbabwe,Africa,Eastern Africa,390757.0,1980.0,11669000,37.8,5951.0,8670.0,Zimbabwe,Republic,Robert G. Mugabe,4068.0,ZW

#### 4. Show population of countries

In [21]:
query="select Name , Population from country ;"
df=pd.read_sql(query,engine)
df

             Name  Population
0           Aruba      103000
1     Afghanistan    22720000
2          Angola    12878000
3        Anguilla        8000
4         Albania     3401200
..            ...         ...
234         Yemen    18112000
235    Yugoslavia    10640000
236  South Africa    40377000
237        Zambia     9169000
238      Zimbabwe    11669000

[239 rows x 2 columns]

### 4. Show top 5  countries by population

In [19]:
query="select Name , Population from country order by Population desc limit 5;"
df=pd.read_sql(query,engine)
df

            Name  Population
0          China  1277558000
1          India  1013662000
2  United States   278357000
3      Indonesia   212107000
4         Brazil   170115000